Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetPhase Method
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetPhase(
	out Phase phase
)
Public Function GetPhase (
	<OutAttribute> ByRef phase As Phase
) As Boolean
Parameters
phase
Type: Tekla.Structures.Model.Phase
The returned phase.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace